{
  "meta": {
    "title": "Jupyter Notebooks",
    "subtitle": "Introduction to scientific computing notebooks",
    "description": "Jupyter notebooks for interactive programming.",
    "slug": "jupyter-notebooks",
    "tags": ["notebooks", "getting-started", "reference"]
  },
  "body": [
    {
      "type": "header",
      "level": 2,
      "text": "Jupyter Notebooks"
    },
    {
      "type": "text",
      "markdown": "[Jupyter Notebooks](https://docs.jupyter.org/en/latest/) have become a staple in the data science community due to their flexibility and powerful features. Notebooks are ideal for EDA, tutorials, and teaching. By seperating code into cells and combining code, documentation, and visualizations notebooks allow for rapid iteration and interactive learning.\n\n[Jupyter Notebook Documentation](https://jupyter-notebook.readthedocs.io/en/stable/)"
    },
    {
      "type": "header",
      "level": 3,
      "text": "Key Features"
    },
    {
      "type": "text",
      "markdown": "- **Interactive Environment**: Jupyter Notebooks provide an interactive environment where you can write and execute code in a step-by-step manner. This is particularly useful for data analysis and exploration.\n\n- **Documentation and Code Together**: You can include markdown cells for documentation alongside your code cells, making it easier to explain your thought process and findings.\n\n- **Visualization Integration**: Jupyter Notebooks support rich outputs such as charts and graphs, which can be rendered directly within the notebook.\n\n- **Reproducibility**: Notebooks can be shared easily, and others can rerun the code to reproduce the results, ensuring transparency and reproducibility in research."
    },


    {
      "type": "header",
      "level": 2,
      "text": "Visual Overview"
    },
    {
      "type": "flipbook",
      "img-json-path": "getting-started/_json/nb-flipbook.json"
    },
    {
      "type": "header",
      "level": 2,
      "text": "Cell Types"
    },
    {
      "type": "text",
      "markdown": "Jupyter Notebooks consist of cells, which are the building blocks of the notebook. There are three main types of cells:\n\n- **Code Cells**: Used to write and execute Python code. The output of the code, such as results or visualizations, appears directly below the cell.\n\n- **Markdown Cells**: Used to write formatted text using Markdown syntax. These cells are perfect for adding explanations, headers, lists, links, and other documentation.\n\n- **Raw Cells**: Used to write plain text that is not processed by the notebook. These cells are rarely used and are generally for specific formats or custom content."
    },
    {
      "type": "header",
      "level": 2,
      "text": "Executing Code"
    },
    {
      "type": "text",
      "markdown": "To execute a code cell, you can use one of the following methods:\n\n- **Keyboard Shortcuts**: Press `Shift + Enter` to run the current cell and move to the next cell. Press `Ctrl + Enter` to run the current cell and stay in the same cell.\n\n- **Toolbar Buttons**: Click the `Run` button in the toolbar to execute the selected cell.\n\nThe output of the code, whether it's text, tables, or visualizations, will be displayed directly below the cell."
    },
    {
      "type": "header",
      "level": 2,
      "text": "Kernels"
    },
    {
      "type": "text",
      "markdown": "A kernel is a computational engine that executes the code contained in the notebook. Here’s how to work with kernels in Jupyter Notebooks:\n\n- **Starting a Kernel**: When you open a Jupyter Notebook, a kernel is automatically started. You can see the kernel status in the top-right corner of the notebook interface.\n\n- **Changing Kernels**: If you want to change the kernel (e.g., switch from Python 3 to another kernel), you can do so from the `Kernel` menu. Select `Change kernel` and choose the desired kernel from the list.\n\n- **Restarting a Kernel**: Sometimes you may need to restart the kernel, especially if it becomes unresponsive or if you want to clear all outputs and start fresh. You can restart the kernel from the `Kernel` menu by selecting `Restart`."
    },
    {
      "type": "header",
      "level": 2,
      "text": "Additional Features"
    },
    {
      "type": "text",
      "markdown": "Jupyter Notebooks offer several other features that enhance the data science workflow:\n\n- **Extensions and Widgets**: There are many extensions and widgets available to extend the functionality of Jupyter Notebooks, such as interactive widgets (ipywidgets), and extensions for improved usability (JupyterLab extensions).\n\n- **Version Control**: You can use version control systems like Git to track changes in your notebooks, making it easier to collaborate and maintain a history of your work.\n\n- **Export Options**: Notebooks can be exported to various formats, including HTML, PDF, and slideshows, making it easy to share your work with others."
    },
    {
      "type": "text",
      "markdown": "Jupyter Notebooks provide an excellent environment for data scientists to perform exploratory data analysis, visualize data, and document their findings. By combining code, documentation, and visualizations in a single document, Jupyter Notebooks enhance the efficiency and reproducibility of data science projects."
    }
  ]
}