{
  "meta": {
    "title": "Tools Overview",
    "subtitle": "Software and tools for programming",
    "description": "Text editors, linters, debugging tools, and more.",
    "slug": "tools-overview",
    "tags": ["workflow"]
  },
  "body": [
    {
      "type": "header",
      "level": 2,
      "text": "Code Editors and Integrated Development Environments (IDEs)"
    },
    {
      "type": "text",
      "markdown": "- **[Visual Studio Code (VS Code)](https://code.visualstudio.com)** - A lightweight, highly customizable code editor with powerful extensions for Python development.\n- [**PyCharm**](https://www.jetbrains.com/pycharm/) - An advanced IDE with comprehensive features for professional Python development, available in both free and paid versions.\n- **[Jupyter](https://jupyter.org/)** - Variety of tools including interactive web-based environments ideal for data science, prototyping, and collaboration.\n- **[Sublime Text](https://www.sublimetext.com/)** - A fast and versatile text editor with a wide range of plugins for Python programming."
    },
    {
      "type": "header",
      "level": 2,
      "text": "Linters and Code Formatters"
    },
    {
      "type": "text",
      "markdown": "- **[Pylint](https://pypi.org/project/pylint/)** - Analyzes Python code to identify errors, enforce coding standards, and suggest improvements.\n- **[Flake8](https://flake8.pycqa.org/en/latest/)** - A tool that combines several Python tools to check the style and quality of your code.\n- **[Black](https://github.com/psf/black)** - An uncompromising code formatter that automatically formats your code to adhere to PEP 8 standards."
    },
    {
      "type": "header",
      "level": 2,
      "text": "Debugging Tools"
    },
    {
      "type": "text",
      "markdown": "- **[pdb](https://docs.python.org/3/library/pdb.html)** - The built-in Python debugger for stepping through code, inspecting variables, and finding bugs.\n- **[ipdb](https://pypi.org/project/ipdb/)** - An enhanced version of pdb with additional features provided by IPython.\n- **Editor & IDE Extensions** - Most modern programming platforms have debugging options adn extensions available."
    },
    {
      "type": "header",
      "level": 2,
      "text": "Version Control"
    },
    {
      "type": "text",
      "markdown": "- **[Git](https://git-scm.com/doc)** - A distributed version control system that tracks changes in your code and allows you to manage versions, branches, and collaboration locally and remotely.\n- **[GitHub](https://github.com/github)** - A cloud-based platform for hosting Git repositories, enabling collaboration, code review, and project management features.\n- **[GitHub Desktop](https://github.com/apps/desktop)** -A user-friendly GUI for Git and GitHub that simplifies committing, branching, and syncing changes without using the command line.\n\n Note: Alternative options exist for this, but this is standard. Stick with it unless you have reason not to."
    },
    {
      "type": "header",
      "level": 2,
      "text": "Environment and Dependency Management"
    },
    {
      "type": "text",
      "markdown": "- **[venv](https://docs.python.org/3/library/venv.html)** - A built-in Python module for creating isolated virtual environments to manage dependencies.\n- **[Anaconda](https://docs.conda.io/projects/conda/en/latest/index.html)** - Environment and package manager that supports multiple languages, ideal for data science projects.\n- **[Pip](https://pypi.org/project/pip/)** - The recommended tool for installing Python packages."
    },
    {
      "type": "header",
      "level": 2,
      "text": "Documentation"
    },
    {
      "type": "text",
      "markdown": "- **[Sphinx](https://www.sphinx-doc.org/en/master/)** - A documentation generator that converts reStructuredText files into HTML, LaTeX, and other formats.\n- **[MkDocs](https://www.mkdocs.org/)** - A static site generator for project documentation using Markdown.\n-**[PEP Style Guides](https://peps.python.org/pep-0008/)** - Conventions for best practices in Python."
    }
  ]
}